flameletModel-2.2.x/tutorials/flameletPisoFoam/Sandia_COH2N2/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.2;
    format      binary;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inletfuel
    {
	type            compressible::turbulentMixingLengthDissipationRateInlet;
	mixingLength	0.0003206;
        value           uniform 3.337e6;
    }
    
    inletair
    {
	type		compressible::turbulentMixingLengthDissipationRateInlet;
	mixingLength	0.021;
        value           uniform 0.00041;

    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    axis
    {
        type            empty;
    }
    
    sidewall
    {
        type 		zeroGradient;
    }
    
    burnerwall
    {
        type            compressible::epsilonWallFunction;
	value		uniform 0.00041;
    }
    
    front
    {
        type            wedge;
    }
    
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
